# Brewfile — Homebrew manifest for new-machine migration.
#
# Restore everything on a new machine:
#   brew bundle install --file=~/Brewfile
#
# Re-snapshot this machine after installing/removing things:
#   brew bundle dump --force --file=~/Brewfile
#
# Check what is missing without installing:
#   brew bundle check --file=~/Brewfile
#
# Covers Homebrew formulae, casks, taps, and VSCode/Cursor extensions.
# (Mac App Store apps would appear as `mas "..."` lines if `mas` were installed.)

tap "nikitabobko/tap"

# Search tool like grep, but optimized for programmers
brew "ack"
# Asciicast to GIF converter
brew "agg"
# Record and share terminal sessions
brew "asciinema"
# Zstandard is a real-time compression algorithm
brew "zstd"
# GNU binary tools for native development
brew "binutils"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# CLI for the Jinja2 templating language
brew "jinja2-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interactive environments for writing and running code
brew "jupyterlab"
# Generic library support script
brew "libtool"
# Next-gen compiler infrastructure
brew "llvm"
# GUI for vim, made for macOS
brew "macvim"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Small build system for use with gyp or CMake
brew "ninja"
# Paragraph reflow for email
brew "par"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Programmatically correct mistyped console commands
brew "thefuck"
# Pager/text based browser
brew "w3m"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"

# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Research management tool
cask "mendeley"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"

vscode "anthropic.claude-code"
vscode "ecmel.vscode-html-css"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.vscode-chat-customizations-evaluations"
vscode "ms-vscode.wordcount"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "yzhang.markdown-all-in-one"
